2017-fall/2017-10-05-session-1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Coding for Adults, Session 1</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Win Treese" />
</head>
<body>
<div id="content">
<h1 class="title">Coding for Adults, Session 1</h1>


<div id="outline-container-org8c1b910" class="outline-2">
<h2 id="org8c1b910">Agenda</h2>
<div class="outline-text-2" id="text-org8c1b910">
<ul class="org-ul">
<li>Introductions all around</li>

<li>Discussion: experiences with computing</li>

<li>What these sessions are all about</li>

<li>Getting set up online</li>

<li>Write a little bit of code!</li>

<li>Regular section: Ask me anything</li>
</ul>
</div>
</div>

<div id="outline-container-org93d08b4" class="outline-2">
<h2 id="org93d08b4">Introductions all around</h2>
<div class="outline-text-2" id="text-org93d08b4">
<p>
Your name
</p>

<p>
Anything you would like to share about what you do in life
</p>

<p>
What brings you to this group?
</p>
</div>
</div>

<div id="outline-container-org80f4dc7" class="outline-2">
<h2 id="org80f4dc7">Discussion: experiences with computing</h2>
<div class="outline-text-2" id="text-org80f4dc7">
<p>
What has been your experience with computing?
</p>

<p>
Have you done any coding before?
</p>
</div>
</div>

<div id="outline-container-orge3dcda9" class="outline-2">
<h2 id="orge3dcda9">What these sessions are all about</h2>
<div class="outline-text-2" id="text-orge3dcda9">
<p>
Knowing even a little bit about how to code is a great way to better understand the technology around us
</p>

<p>
Thinking computationally is another valuable tool in our mental toolbox
</p>

<p>
It&rsquo;s easier to approach these topics in a group
</p>

<p>
Making software is creative and fun!
</p>

<p>
We&rsquo;re going to focus on coding for the web: HTML, CSS, and JavaScript.
</p>
</div>
</div>

<div id="outline-container-orgce7e150" class="outline-2">
<h2 id="orgce7e150">Schedule for our sessions</h2>
<div class="outline-text-2" id="text-orgce7e150">
<p>
Thursdays at 7 through early December, with some exceptions:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">10/5</td>
<td class="org-left">11/9 skip</td>
</tr>

<tr>
<td class="org-left">10/12 skip</td>
<td class="org-left">11/16</td>
</tr>

<tr>
<td class="org-left">10/19</td>
<td class="org-left">11/23 Thanksgiving</td>
</tr>

<tr>
<td class="org-left">10/26</td>
<td class="org-left">11/30</td>
</tr>

<tr>
<td class="org-left">11/2</td>
<td class="org-left">12/7</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgffd4fc2" class="outline-2">
<h2 id="orgffd4fc2">How the sessions will work</h2>
<div class="outline-text-2" id="text-orgffd4fc2">
<p>
We&rsquo;ll use a web site for learning: CodeCademy, and a collaboration site, GitHub.
</p>

<p>
You can do CodeCademy lessons here (and at home, if you want)
</p>

<p>
Typical session:
</p>

<ol class="org-ol">
<li>Opening questions about what we&rsquo;ve done so far or learning at home</li>
<li>Work through online lessons</li>
<li>Work on a challenge problem in pairs</li>
<li>Share solutions and what we learned</li>
<li>Ask me anything</li>
</ol>
</div>
</div>

<div id="outline-container-org95ef3bc" class="outline-2">
<h2 id="org95ef3bc">Ground rules</h2>
<div class="outline-text-2" id="text-org95ef3bc">
<ol class="org-ol">
<li>We&rsquo;re in this together.</li>
<li>There are no stupid questions.</li>
<li>Stop me at any time for questions.</li>
<li>Software is a big and complicated subject, and no one knows everything about it.</li>
<li>There&rsquo;s always more behind anything we talk about.</li>
<li>We can always go deeper, but stop me if it&rsquo;s getting to be too much!</li>
<li>We imagine that the main thing is the programming language, but there&rsquo;s always a lot of other stuff to learn around that.</li>
<li>If something isn&rsquo;t working for you, let me know.</li>
</ol>
</div>
</div>
<div id="outline-container-orga837df8" class="outline-2">
<h2 id="orga837df8">Getting set up online: Codecademy</h2>
<div class="outline-text-2" id="text-orga837df8">
<p target="_blank">
Open <a href="http://codecademy.com" target="_blank">http://codecademy.com</a> in your browser
</p>

<ol class="org-ol">
<li>Create an account to login</li>

<li>We&rsquo;re here for &ldquo;web development&rdquo;</li>

<li>We want the &ldquo;Make a Website&rdquo; course</li>
</ol>

<p>
We&rsquo;ll explore the course later, or you can get started on your own at home.
</p>
</div>
</div>
<div id="outline-container-org18ca385" class="outline-2">
<h2 id="org18ca385">Getting set up: GitHub</h2>
<div class="outline-text-2" id="text-org18ca385">
<p>
GitHub is a site for collaborative work on the web.
</p>

<p>
<i>Note: everything on GitHub is public.</i>
</p>

<p target="_blank">
Open <a href="http://github.com" target="_blank">http://github.com</a> in your browser
</p>

<ol class="org-ol">
<li>Create an account to login</li>
<li>Take the free account</li>
<li>Fill out the &ldquo;tailor your experience&rdquo;</li>
<li>Click &ldquo;Start a project&rdquo;</li>
<li>It will ask you to verify by sending you an email</li>
<li>When you get the email, confirm and click &ldquo;Start a project again&rdquo;</li>
</ol>
</div>
</div>

<div id="outline-container-org7dc8ae7" class="outline-2">
<h2 id="org7dc8ae7">Write a little bit of code!</h2>
<div class="outline-text-2" id="text-org7dc8ae7">
<ol class="org-ol">
<li>Put in a new project name &lt;username&gt;.github.io (and &lt;username&gt; should be your new username on GitHub)</li>
<li>Click the box for &ldquo;Initialize this repository with a README&rdquo;</li>
<li>Click &ldquo;Create repository&rdquo;</li>
<li>On the next page, click &ldquo;Create new file&rdquo;</li>
<li>Near the top, where it says &ldquo;Name your file&#x2026;&rdquo;, type &ldquo;index.html&rdquo; (no quotes)</li>
</ol>
</div>
</div>

<div id="outline-container-org3fcab78" class="outline-2">
<h2 id="org3fcab78">Type in the code</h2>
<div class="outline-text-2" id="text-org3fcab78">
<p>
In the text box, type exactly what you see here:
</p>
<pre class="example">
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;A new page&lt;/title&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;h1&gt;This is my first web page!&lt;/h1&gt;
&lt;p&gt;I created it myself.&lt;/p&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre>

<p>
At the bottom of the page, click &ldquo;Commit new file&rdquo;
</p>
</div>
</div>

<div id="outline-container-org8474d26" class="outline-2">
<h2 id="org8474d26">Let&rsquo;s see what we did</h2>
<div class="outline-text-2" id="text-org8474d26">
<ol class="org-ol">
<li>In a new browser tab or window, open &ldquo;&lt;username&gt;.github.io&rdquo;</li>
<li>It should look something like <a href="http://wtreese2.github.io">http://wtreese2.github.io</a></li>
<li>If you want to edit your file, you can do it by clicking the pencil item on the github page</li>
<li>After you commit a change, the web page will be available a few moments later at &lt;username&gt;.github.io</li>
</ol>

<p>
Now email your username to <code>treese@acm.org</code> so I can add you to the Wayland Codes project!
</p>
</div>
</div>
<div id="outline-container-orgae04026" class="outline-2">
<h2 id="orgae04026">Congratulations!</h2>
<div class="outline-text-2" id="text-orgae04026">
<p>
You wrote some code and made a web page, using the same tools as professional developers use.
</p>
</div>
</div>
<div id="outline-container-orge069a2e" class="outline-2">
<h2 id="orge069a2e">Homework</h2>
<div class="outline-text-2" id="text-orge069a2e">
<p>
This is all optional:
</p>

<ul class="org-ul">
<li>Work through some sessions on Codecademy</li>
<li>Post an issue on the WaylandCode github project (you&rsquo;ll get an email invitation to join it). Post an intro issue to try it out.</li>
<li>If you have coding questions, post them as issues on WaylandCodes</li>
<li>Have some fun adding to your web page, especially as you learn things from Codecademy</li>
<li>Try adding, changing, or deleting characters from the web page you made, and see what happens. You can always fix it back!</li>
</ul>
</div>
</div>

<div id="outline-container-orgfc4577b" class="outline-2">
<h2 id="orgfc4577b">Regular section: Ask me anything</h2>
<div class="outline-text-2" id="text-orgfc4577b">
<p>
Anything about computing is fair game
</p>

<p>
&#x2026; and no question is stupid or too basic.
</p>
</div>
</div>

<div id="outline-container-org6da0b4c" class="outline-2">
<h2 id="org6da0b4c">Bonus: Debugging tips</h2>
<div class="outline-text-2" id="text-org6da0b4c">
<ol class="org-ol">
<li>What were you trying to do?</li>
<li>What did you expect to happen?</li>
<li>What happened?</li>
<li>What did you change most recently?</li>
</ol>
</div>
</div>

<div id="outline-container-org2f13fb5" class="outline-2">
<h2 id="org2f13fb5">Bonus: Other online resources</h2>
<div class="outline-text-2" id="text-org2f13fb5">
<p>
If you want to try other online resources, feel free! Search the web or try these:
</p>

<ul class="org-ul">
<li>Khan Academy: <a href="https://www.khanacademy.org/#/computing">https://www.khanacademy.org/#/computing</a></li>
<li>Learn JavaScript the Hard Way: <a href="https://learncodethehardway.org/javascript/">https://learncodethehardway.org/javascript/</a> (also Python, Ruby, etc.)</li>
<li>Lynda.com via the library</li>
</ul>
</div>
</div>

<div id="outline-container-org97dc50b" class="outline-2">
<h2 id="org97dc50b">Bonus: Keeping a coding journal</h2>
<div class="outline-text-2" id="text-org97dc50b">
<p>
You may find it useful to keep a journal of:
</p>

<ul class="org-ul">
<li>Things you learn in coding</li>
<li>Coding ideas and questions you have</li>
<li>Problems you ran into and how you worked through them</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 5 October 2017</p>
<p class="author">Author: Win Treese</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>